IdeaRS.OpenModel.Connection.CutData
Provides data of the cut beam

IdeaRS.OpenModel.Connection.CutData.PlanePoint
3DPlane Point

IdeaRS.OpenModel.Connection.CutData.PlaneNormalX
3DPlane Normal AxisX

IdeaRS.OpenModel.Connection.CutData.PlaneNormalY
3DPlane Normal AxisY